def convert_to_other_bases(decimal,base):# Дефиниране на функцията и нейните параметри
    #Проверяваме дали числото което е въведено е естествено и дали е в интервала 100-1000
   if str(decimal).isdigit() and float(decimal) == int(decimal) and 100 <= int(decimal) <= 1000: # str(decimal)- преобразуваме числото във стринг -> isDigit() - проверяваме дали всички букви във стринга са числа -> float(decimal) - преобразуваме числото във число със плаваша запетая -> int(decimal) - преобразуваме числото със плаваща запетая в еквивалентното му цяло число -> най накрая проверяваме дали числото зададено в параметрите е между 100-1000 -> ако и 3те условия върнат true функцията продължава със кода иначе отиваме във else принтираме съобщението и функцията приключва
    #Преобразуване към двойчна бройна система
        if base == 'binary': #проверка дали посочената бройна система е двойчна
            binary = "{0:b}".format(decimal) #използваме стринг форматиране за да изведем еквивалентната стойност във двойчна бройна система
            print(f"{decimal} in binary: {binary}") #Принтираме резултата
    #Преобразуване към осмична бройна системаако по горното условие не съвпада
        elif base == 'octal': #проверка дали посочената бройна система е осмична
            octal = "{0:o}".format(decimal) #използваме стринг форматиране за да изведем еквивалентната стойност във осмична бройна система
            print(f"{decimal} in octal: {octal}") # Принтираме резултата
   else:  #Връщаме съобщение ако въведеното число не е естествено и не е в интервала 100-1000
        print(f"number needs to be a natural number between 100 and 1000") #Принтираме резултата


num = int(input("Enter a number between 100 - 1000: "))
base = str(input("Enter binary or octal: "))
convert_to_other_bases(num, base) #Изпълнение на функцията със желаните условия
input("Press [Enter] to continue.")